import pandas as pd

# 地方中枢都市のデータ
jp_cities = pd.DataFrame(
    {
        "都市名": ["札幌", "仙台", "東京", "名古屋", "大阪", "広島", "福岡", "那覇"],
        "緯度": [
            43.0621,
            38.2682,
            35.6895,
            35.1815,
            34.6937,
            34.3853,
            33.5904,
            26.2124,
        ],
        "経度": [
            141.3544,
            140.8694,
            139.6917,
            136.9066,
            135.5023,
            132.4553,
            130.4017,
            127.6792,
        ],
    }
)
world_cities = pd.DataFrame(
    {
        "都市名": [
            "ニューヨーク",
            "ロンドン",
            "パリ",
            "シドニー",
            "ベルリン",
            "モスクワ",
            "カイロ",
            "リオデジャネイロ",
            "トロント",
            "ドバイ",
        ],
        "緯度": [
            40.7128,
            51.5074,
            48.8566,
            -33.8688,
            52.5200,
            55.7558,
            30.0444,
            -22.9068,
            43.6532,
            25.2048,
        ],
        "経度": [
            -74.0060,
            -0.1278,
            2.3522,
            151.2093,
            13.4050,
            37.6173,
            31.2357,
            -43.1729,
            -79.3832,
            55.2708,
        ],
    }
)

# 新しい都市を既存のDataFrameに追加
cities = pd.concat([jp_cities, world_cities], ignore_index=True)
